TRUNCATE TABLE tab_spot;
INSERT INTO tab_spot (spot_name, latitude, longitude) VALUES
  ('天津', 39.067659254941,117.15266523691),
  ('长沙', 28.157257036612,112.95078496566),
  ('大同', 40.062323782956,113.34661252337),
  ('呼和浩特', 40.868283995479,111.71692023158),
  ('济南', 36.802028182562,117.21337371141),
  ('莆田', 25.492851742573,119.03194801518),
  ('青岛', 36.069648537928,120.31782601656),
  ('沈阳', 41.924846888642,123.4248819704),
  ('西安', 34.39495052797, 109.29137902407);


TRUNCATE TABLE tab_route;
INSERT INTO tab_route (route_name, begin_spot, end_spot) VALUES
  ('天津至长沙', 1, 2),
  ('天津至大同', 1, 3),
  ('天津至呼和浩特', 1, 4),
  ('天津至济南', 1, 5),
  ('天津至莆田', 1, 6),
  ('天津至青岛', 1, 7),
  ('天津至沈阳', 1, 8),
  ('天津至西安', 1, 9);